use plc_util::filtered_assert_snapshot;

mod expression_debugging;

use test_utils::codegen_with_debug as codegen;
use test_utils::codegen_with_debug_version;

#[test]
fn test_global_var_int_added_to_debug_info() {
    let codegen = codegen(
        r#"
    VAR_GLOBAL
        a : SINT; //8bit
        b : USINT; //8bit
        c : INT; //16bit
        d : UINT; //16bit
        e : DINT; //32bit
        f : UDINT; //32bit
        g : LINT; //64bit
        h : ULINT; //64bit
    END_VAR
    "#,
    );

    filtered_assert_snapshot!(codegen)
}

#[test]
fn test_global_var_byteseq_added_to_debug_info() {
    let codegen = codegen(
        r#"
    VAR_GLOBAL
        a : BOOL; //8bit DW_ATE_boolean
        b : BYTE; //8bit
        c : WORD; //16bit
        d : DWORD; //32bit
        e : LWORD; //64bit
    END_VAR
    "#,
    );

    filtered_assert_snapshot!(codegen)
}

#[test]
fn test_global_var_enum_added_to_debug_info() {
    //Multiple types
    let codegen = codegen(
        r#"
    TYPE en1 : (a,b,c); END_TYPE
    TYPE en2 : BYTE (d,e,f); END_TYPE
    VAR_GLOBAL
        en3 : LINT (a,b,c);
    END_VAR
    "#,
    );

    filtered_assert_snapshot!(codegen)
}

#[test]
fn test_global_var_float_added_to_debug_info() {
    let codegen = codegen(
        r#"
    VAR_GLOBAL
        a : REAL;
        b : LREAL;
    END_VAR
    "#,
    );

    filtered_assert_snapshot!(codegen)
}

#[test]
fn test_global_var_array_added_to_debug_info() {
    let codegen = codegen(
        r#"

      %tmpVar19 = getelementptr inbounds [3 x [81 x i8]], [3 x [81 x i8]]* %arr18, i32 0, i32 1, !dbg !62
      %13 = bitcast [81 x i8]* %tmpVar16 to i8*, !dbg !62
      %14 = bitcast [81 x i8]* %tmpVar19 to i8*, !dbg !62
      call void @llvm.memcpy.p0i8.p0i8.i32(i8* align 1 %13, i8* align 1 %14, i32 80, i1 false), !dbg !62
      %tmpVar20 = getelementptr inbounds [3 x [81 x i8]], [3 x [81 x i8]]* %arr, i32 0, i32 2, !dbg !63
      %inner21 = getelementptr inbounds %struct_, %struct_* %st, i32 0, i32 0, !dbg !63
      %arr22 = getelementptr inbounds %inner, %inner* %inner21, i32 0, i32 3, !dbg !63
      %tmpVar23 = getelementptr inbounds [3 x [81 x i8]], [3 x [81 x i8]]* %arr22, i32 0, i32 2, !dbg !63
      %15 = bitcast [81 x i8]* %tmpVar20 to i8*, !dbg !63
      %16 = bitcast [81 x i8]* %tmpVar23 to i8*, !dbg !63
      call void @llvm.memcpy.p0i8.p0i8.i32(i8* align 1 %15, i8* align 1 %16, i32 80, i1 false), !dbg !63
      ret void, !dbg !64
    }

    ; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
    declare void @llvm.dbg.declare(metadata, metadata, metadata) #0

    ; Function Attrs: argmemonly nofree nounwind willreturn
    declare void @llvm.memcpy.p0i8.p0i8.i64(i8* noalias nocapture writeonly, i8* noalias nocapture readonly, i64, i1 immarg) #1

    ; Function Attrs: argmemonly nofree nounwind willreturn writeonly
    declare void @llvm.memset.p0i8.i64(i8* nocapture writeonly, i8, i64, i1 immarg) #2

    ; Function Attrs: argmemonly nofree nounwind willreturn
    declare void @llvm.memcpy.p0i8.p0i8.i32(i8* noalias nocapture writeonly, i8* noalias nocapture readonly, i32, i1 immarg) #1

    define void @__init_struct_(%struct_* %0) {
    entry:
      %self = alloca %struct_*, align 8
      store %struct_* %0, %struct_** %self, align 8
      %deref = load %struct_*, %struct_** %self, align 8
      %inner = getelementptr inbounds %struct_, %struct_* %deref, i32 0, i32 0
      call void @__init_inner(%inner* %inner)
      %deref1 = load %struct_*, %struct_** %self, align 8
      %s = getelementptr inbounds %struct_, %struct_* %deref1, i32 0, i32 2
      %1 = bitcast [81 x i8]* %s to i8*
      call void @llvm.memcpy.p0i8.p0i8.i32(i8* align 1 %1, i8* align 1 getelementptr inbounds ([6 x i8], [6 x i8]* @utf08_literal_0, i32 0, i32 0), i32 6, i1 false)
      %deref2 = load %struct_*, %struct_** %self, align 8
      %b = getelementptr inbounds %struct_, %struct_* %deref2, i32 0, i32 3
      store i8 1, i8* %b, align 1
      %deref3 = load %struct_*, %struct_** %self, align 8
      %r = getelementptr inbounds %struct_, %struct_* %deref3, i32 0, i32 4
      store float 0x400921CAC0000000, float* %r, align 4
      %deref4 = load %struct_*, %struct_** %self, align 8
      %i = getelementptr inbounds %struct_, %struct_* %deref4, i32 0, i32 6
      store i16 42, i16* %i, align 2
      ret void
    }

    define void @__init_inner(%inner* %0) {
    entry:
      %self = alloca %inner*, align 8
      store %inner* %0, %inner** %self, align 8
      %deref = load %inner*, %inner** %self, align 8
      %s = getelementptr inbounds %inner, %inner* %deref, i32 0, i32 0
      %1 = bitcast [81 x i8]* %s to i8*
      call void @llvm.memcpy.p0i8.p0i8.i32(i8* align 1 %1, i8* align 1 getelementptr inbounds ([6 x i8], [6 x i8]* @utf08_literal_0, i32 0, i32 0), i32 6, i1 false)
      %deref1 = load %inner*, %inner** %self, align 8
      %b = getelementptr inbounds %inner, %inner* %deref1, i32 0, i32 1
      store i8 1, i8* %b, align 1
      %deref2 = load %inner*, %inner** %self, align 8
      %r = getelementptr inbounds %inner, %inner* %deref2, i32 0, i32 2
      store float 0x400921CAC0000000, float* %r, align 4
      %deref3 = load %inner*, %inner** %self, align 8
      %i = getelementptr inbounds %inner, %inner* %deref3, i32 0, i32 4
      store i16 42, i16* %i, align 2
      ret void
    }

    define void @__user_init_inner(%inner* %0) {
    entry:
      %self = alloca %inner*, align 8
      store %inner* %0, %inner** %self, align 8
      ret void
    }

    define void @__user_init_struct_(%struct_* %0) {
    entry:
      %self = alloca %struct_*, align 8
      store %struct_* %0, %struct_** %self, align 8
      %deref = load %struct_*, %struct_** %self, align 8
      %inner = getelementptr inbounds %struct_, %struct_* %deref, i32 0, i32 0
      call void @__user_init_inner(%inner* %inner)
      ret void
    }

    define void @__init___Test() {
    entry:
      ret void
    }

    attributes #0 = { nofree nosync nounwind readnone speculatable willreturn }
    attributes #1 = { argmemonly nofree nounwind willreturn }
    attributes #2 = { argmemonly nofree nounwind willreturn writeonly }

    !llvm.module.flags = !{!34, !35}
    !llvm.dbg.cu = !{!36}

    !0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
    !1 = distinct !DIGlobalVariable(name: "__struct___init", scope: !2, file: !2, line: 2, type: !3, isLocal: false, isDefinition: true)
    !2 = !DIFile(filename: "<internal>", directory: "")
    !3 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
    !4 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_", scope: !2, file: !2, line: 2, size: 13440, align: 64, flags: DIFlagPublic, elements: !5, identifier: "struct_")
    !5 = !{!6, !24, !26, !27, !28, !29, !30}
    !6 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2, file: !2, line: 3, baseType: !7, size: 2688, align: 64, flags: DIFlagPublic)
    !7 = !DICompositeType(tag: DW_TAG_structure_type, name: "inner", scope: !2, file: !2, line: 13, size: 2688, align: 64, flags: DIFlagPublic, elements: !8, identifier: "inner")
    !8 = !{!9, !14, !16, !18, !22}
    !9 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !2, file: !2, line: 14, baseType: !10, size: 648, align: 8, flags: DIFlagPublic)
    !10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 648, align: 8, elements: !12)
    !11 = !DIBasicType(name: "CHAR", size: 8, encoding: DW_ATE_UTF, flags: DIFlagPublic)
    !12 = !{!13}
    !13 = !DISubrange(count: 81, lowerBound: 0)
    !14 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !2, file: !2, line: 15, baseType: !15, size: 8, align: 8, offset: 648, flags: DIFlagPublic)
    !15 = !DIBasicType(name: "BOOL", size: 8, encoding: DW_ATE_boolean, flags: DIFlagPublic)
    !16 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2, file: !2, line: 16, baseType: !17, size: 32, align: 32, offset: 672, flags: DIFlagPublic)
    !17 = !DIBasicType(name: "REAL", size: 32, encoding: DW_ATE_float, flags: DIFlagPublic)
    !18 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !2, file: !2, line: 17, baseType: !19, size: 1944, align: 8, offset: 704, flags: DIFlagPublic)
    !19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1944, align: 8, elements: !20)
    !20 = !{!21}
    !21 = !DISubrange(count: 3, lowerBound: 0)
    !22 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !2, file: !2, line: 18, baseType: !23, size: 16, align: 16, offset: 2656, flags: DIFlagPublic)
    !23 = !DIBasicType(name: "INT", size: 16, encoding: DW_ATE_signed, flags: DIFlagPublic)
    !24 = !DIDerivedType(tag: DW_TAG_member, name: "inner_arr", scope: !2, file: !2, line: 4, baseType: !25, size: 8064, align: 64, offset: 2688, flags: DIFlagPublic)
    !25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8064, align: 64, elements: !20)
    !26 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !2, file: !2, line: 5, baseType: !10, size: 648, align: 8, offset: 10752, flags: DIFlagPublic)
    !27 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !2, file: !2, line: 6, baseType: !15, size: 8, align: 8, offset: 11400, flags: DIFlagPublic)
    !28 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2, file: !2, line: 7, baseType: !17, size: 32, align: 32, offset: 11424, flags: DIFlagPublic)
    !29 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !2, file: !2, line: 8, baseType: !19, size: 1944, align: 8, offset: 11456, flags: DIFlagPublic)
    !30 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !2, file: !2, line: 9, baseType: !23, size: 16, align: 16, offset: 13408, flags: DIFlagPublic)
    !31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
    !32 = distinct !DIGlobalVariable(name: "__inner__init", scope: !2, file: !2, line: 13, type: !33, isLocal: false, isDefinition: true)
    !33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
    !34 = !{i32 2, !"Dwarf Version", i32 5}
    !35 = !{i32 2, !"Debug Info Version", i32 3}
    !36 = distinct !DICompileUnit(language: DW_LANG_C, file: !2, producer: "RuSTy Structured text Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
    !37 = !{!0, !31}
    !38 = distinct !DISubprogram(name: "main", linkageName: "main", scope: !2, file: !2, line: 22, type: !39, scopeLine: 22, flags: DIFlagPublic, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !41)
    !39 = !DISubroutineType(flags: DIFlagPublic, types: !40)
    !40 = !{null}
    !41 = !{}
    !42 = !DILocalVariable(name: "st", scope: !38, file: !2, line: 24, type: !4, align: 64)
    !43 = !DILocation(line: 24, column: 4, scope: !38)
    !44 = !DILocalVariable(name: "s", scope: !38, file: !2, line: 25, type: !10, align: 8)
    !45 = !DILocation(line: 25, column: 4, scope: !38)
    !46 = !DILocalVariable(name: "b", scope: !38, file: !2, line: 26, type: !15, align: 8)
    !47 = !DILocation(line: 26, column: 4, scope: !38)
    !48 = !DILocalVariable(name: "arr", scope: !38, file: !2, line: 27, type: !19, align: 8)
    !49 = !DILocation(line: 27, column: 4, scope: !38)
    !50 = !DILocalVariable(name: "i", scope: !38, file: !2, line: 28, type: !23, align: 16)
    !51 = !DILocation(line: 28, column: 4, scope: !38)
    !52 = !DILocation(line: 0, scope: !38)
    !53 = !DILocation(line: 32, column: 4, scope: !38)
    !54 = !DILocation(line: 33, column: 4, scope: !38)
    !55 = !DILocation(line: 34, column: 4, scope: !38)
    !56 = !DILocation(line: 35, column: 4, scope: !38)
    !57 = !DILocation(line: 36, column: 4, scope: !38)
    !58 = !DILocation(line: 37, column: 4, scope: !38)
    !59 = !DILocation(line: 38, column: 4, scope: !38)
    !60 = !DILocation(line: 39, column: 4, scope: !38)
    !61 = !DILocation(line: 41, column: 4, scope: !38)
    !62 = !DILocation(line: 42, column: 4, scope: !38)
    !63 = !DILocation(line: 43, column: 4, scope: !38)
    !64 = !DILocation(line: 45, scope: !38)
    "###);
}

#[test]
fn constants_are_tagged_as_such() {
    let result = codegen(
        "
        VAR_GLOBAL CONSTANT
            x: DINT;
            s: STRING;
            f: foo;
        END_VAR

        PROGRAM prog
        VAR CONSTANT
            a, b, c: DINT;
        END_VAR
        END_PROGRAM

        TYPE foo : STRUCT
            z: DINT;
        END_STRUCT
        END_TYPE

        FUNCTION bar : DINT
        VAR CONSTANT
            d: DINT := 42;
        END_VAR
        END_FUNCTION
    ",
    );

    filtered_assert_snapshot!(result, @r#"
    ; ModuleID = '<internal>'
    source_filename = "<internal>"
    target datalayout = "[filtered]"
    target triple = "[filtered]"

    %prog = type { i32, i32, i32 }
    %foo = type { i32 }

    @x = unnamed_addr constant i32 0, !dbg !0
    @s = unnamed_addr constant [81 x i8] zeroinitializer, !dbg !5
    @llvm.global_ctors = appending global [1 x { i32, void ()*, i8* }] [{ i32, void ()*, i8* } { i32 0, void ()* @__init___Test, i8* null }]
    @prog_instance = global %prog zeroinitializer, !dbg !12
    @__foo__init = unnamed_addr constant %foo zeroinitializer, !dbg !19
    @f = unnamed_addr constant %foo zeroinitializer, !dbg !25

    define void @prog(%prog* %0) !dbg !31 {
    entry:
      call void @llvm.dbg.declare(metadata %prog* %0, metadata !35, metadata !DIExpression()), !dbg !36
      %a = getelementptr inbounds %prog, %prog* %0, i32 0, i32 0
      %b = getelementptr inbounds %prog, %prog* %0, i32 0, i32 1
      %c = getelementptr inbounds %prog, %prog* %0, i32 0, i32 2
      ret void, !dbg !36
    }

    define i32 @bar() !dbg !37 {
    entry:
      %bar = alloca i32, align 4
      %d = alloca i32, align 4
      call void @llvm.dbg.declare(metadata i32* %d, metadata !40, metadata !DIExpression()), !dbg !41
      store i32 42, i32* %d, align 4
      call void @llvm.dbg.declare(metadata i32* %bar, metadata !42, metadata !DIExpression()), !dbg !43
      store i32 0, i32* %bar, align 4
      %bar_ret = load i32, i32* %bar, align 4, !dbg !44
      ret i32 %bar_ret, !dbg !44
    }

    ; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
    declare void @llvm.dbg.declare(metadata, metadata, metadata) #0

    define void @__init_foo(%foo* %0) {
    entry:
      %self = alloca %foo*, align 8
      store %foo* %0, %foo** %self, align 8
      ret void
    }

    define void @__init_prog(%prog* %0) {
    entry:
      %self = alloca %prog*, align 8
      store %prog* %0, %prog** %self, align 8
      ret void
    }

    define void @__user_init_foo(%foo* %0) {
    entry:
      %self = alloca %foo*, align 8
      store %foo* %0, %foo** %self, align 8
      ret void
    }

    define void @__user_init_prog(%prog* %0) {
    entry:
      %self = alloca %prog*, align 8
      store %prog* %0, %prog** %self, align 8
      ret void
    }

    define void @__init___Test() {
    entry:
      call void @__init_prog(%prog* @prog_instance)
      call void @__init_foo(%foo* @f)
      call void @__user_init_prog(%prog* @prog_instance)
      call void @__user_init_foo(%foo* @f)
      ret void
    }

    attributes #0 = { nofree nosync nounwind readnone speculatable willreturn }

    !llvm.module.flags = !{!27, !28}
    !llvm.dbg.cu = !{!29}

    !0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
    !1 = distinct !DIGlobalVariable(name: "x", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true)
    !2 = !DIFile(filename: "<internal>", directory: "")
    !3 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
    !4 = !DIBasicType(name: "DINT", size: 32, encoding: DW_ATE_signed, flags: DIFlagPublic)
    !5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
    !6 = distinct !DIGlobalVariable(name: "s", scope: !2, file: !2, line: 4, type: !7, isLocal: false, isDefinition: true)
    !7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
    !8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 648, align: 8, elements: !10)
    !9 = !DIBasicType(name: "CHAR", size: 8, encoding: DW_ATE_UTF, flags: DIFlagPublic)
    !10 = !{!11}
    !11 = !DISubrange(count: 81, lowerBound: 0)
    !12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
    !13 = distinct !DIGlobalVariable(name: "prog", scope: !2, file: !2, line: 8, type: !14, isLocal: false, isDefinition: true)
    !14 = !DICompositeType(tag: DW_TAG_structure_type, name: "prog", scope: !2, file: !2, line: 8, size: 96, align: 64, flags: DIFlagPublic, elements: !15, identifier: "prog")
    !15 = !{!16, !17, !18}
    !16 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !2, file: !2, line: 10, baseType: !3, size: 32, align: 32, flags: DIFlagPublic)
    !17 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !2, file: !2, line: 10, baseType: !3, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
    !18 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !2, file: !2, line: 10, baseType: !3, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
    !19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
    !20 = distinct !DIGlobalVariable(name: "__foo__init", scope: !2, file: !2, line: 14, type: !21, isLocal: false, isDefinition: true)
    !21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
    !22 = !DICompositeType(tag: DW_TAG_structure_type, name: "foo", scope: !2, file: !2, line: 14, size: 32, align: 64, flags: DIFlagPublic, elements: !23, identifier: "foo")
    !23 = !{!24}
    !24 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !2, file: !2, line: 15, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
    !25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
    !26 = distinct !DIGlobalVariable(name: "f", scope: !2, file: !2, line: 5, type: !21, isLocal: false, isDefinition: true)
    !27 = !{i32 2, !"Dwarf Version", i32 5}
    !28 = !{i32 2, !"Debug Info Version", i32 3}
    !29 = distinct !DICompileUnit(language: DW_LANG_C, file: !2, producer: "RuSTy Structured text Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !30, splitDebugInlining: false)
    !30 = !{!0, !5, !25, !19, !12}
    !31 = distinct !DISubprogram(name: "prog", linkageName: "prog", scope: !2, file: !2, line: 8, type: !32, scopeLine: 12, flags: DIFlagPublic, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !34)
    !32 = !DISubroutineType(flags: DIFlagPublic, types: !33)
    !33 = !{null, !14}
    !34 = !{}
    !35 = !DILocalVariable(name: "prog", scope: !31, file: !2, line: 12, type: !14)
    !36 = !DILocation(line: 12, column: 8, scope: !31)
    !37 = distinct !DISubprogram(name: "bar", linkageName: "bar", scope: !2, file: !2, line: 19, type: !38, scopeLine: 23, flags: DIFlagPublic, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !34)
    !38 = !DISubroutineType(flags: DIFlagPublic, types: !39)
    !39 = !{null}
    !40 = !DILocalVariable(name: "d", scope: !37, file: !2, line: 21, type: !3, align: 32)
    !41 = !DILocation(line: 21, column: 12, scope: !37)
    !42 = !DILocalVariable(name: "bar", scope: !37, file: !2, line: 19, type: !4, align: 32)
    !43 = !DILocation(line: 19, column: 17, scope: !37)
    !44 = !DILocation(line: 23, column: 8, scope: !37)
    "#);
}
